app/controllers/questions_controller.rb

  def index
    @questions = Question.find(:all, :conditions => ["user_id = ?", current_user.id], :order => "created_at ASC")
---
SELECT "questions".* FROM "questions" WHERE (user_id = 1) ORDER BY created_at ASC

  def show
    @question = Question.find(:first, :conditions => ["id = ? and user_id = ? ", params[:id], current_user.id] )
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @question = Question.find(:first, :conditions => ["id = ? and user_id = ? ", params[:id], current_user.id] )
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @question = Question.new(params[:question])
    @question.user_id = current_user.id

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "description", "image_uri", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def update
    @question = Question.find(:first, :conditions => ["id = ? and user_id = ? ", params[:id], current_user.id] )
---
SELECT "questions".* FROM "questions" WHERE (id = '3' and user_id = 1 ) LIMIT 1